Autodesk.Revit.DB.Structure.RebarPropagation.AlignByFace(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.Rebar},Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Reference)
It will copy the source rebars, will align them to the destination face based on the source face and adapt them to destination host.
Remarks:
The source and destination hosts represented by the source and destination references can be the same element or can be difereent elements. They can also be of different categories
The destination host must be able to host rebar.
The source rebars should not be gourp members.
This method uses its own transaction, so it's not permitted to be invoked in an active transaction.
doc:
A document.
sourceRebars:
The rebars that will be propagated. All of them must be from the same host as the source face reference.
sourceFaceReference:
A reference to a face in the source host.
destinationFaceReference:
A reference to a face in the destions host.
Returns:
The newly created rebars.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element that contains the destinationFaceReference is not a valid rebar host.
-or-
The rebars should be from the same host as the source face reference.
-or-
The rebars that are group members can't be propagated.
-or-
The references should represent faces that have same type of surface.
-or-
The source and destination face references should be different.
-or-
This method uses its own transaction, so it's not permitted to be invoked in an active transaction.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.RebarPropagation.AlignByHost(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.Rebar},Autodesk.Revit.DB.Element)
It will copy the source rebars, will align them in the same way as how the source host is aligned to destination host and will adapt them to the destinaion host.
Remarks:
The source and destination hosts should be of the same category.
The source and destination hosts should be different elements.
The destination host must be able to host rebar.
The source rebars should not be gourp members.
This method uses its own transaction, so it's not permitted to be invoked in an active transaction.
doc:
A document.
sourceRebars:
The rebars that will be propagated. All of them must be from the same host.
destinationHost:
The destination host where the new rebar will be created.
Returns:
The newly created rebars.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no source rebars to propagate.
-or-
The rebars should be from the same host.
-or-
The rebars that are group members can't be propagated.
-or-
destinationHost is not a valid rebar host.
-or-
The source and destination hosts should be of the same category.
-or-
The source and destination hosts must be different elements.
-or-
This method uses its own transaction, so it's not permitted to be invoked in an active transaction.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.RebarPropagation
An utility class containing functions that can be used to propagate rebar elements.
Since:
2023